## Staging: iam
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                         NAME                          |
|--------|-------------------------------------------------------|
| add    | `aws_iam_policy.ai_answers_pr_review`                 |
|        | `aws_iam_policy.pr-review-env-lambda`                 |
|        | `aws_iam_role.pr-review-env-lambda`                   |
|        | `aws_iam_role_policy_attachment.pr-review-env-lambda` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.lambda_function_manage will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_function_manage" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:AddPermission",
              + "lambda:CreateFunction",
              + "lambda:CreateFunctionUrlConfig",
              + "lambda:DeleteFunction",
              + "lambda:DeleteFunctionConcurrency",
              + "lambda:DeleteFunctionUrlConfig",
              + "lambda:GetFunction",
              + "lambda:GetFunctionConfiguration",
              + "lambda:GetFunctionUrlConfig",
              + "lambda:ListFunctionUrlConfigs",
              + "lambda:PutFunctionConcurrency",
              + "lambda:UpdateFunctionCode",
              + "lambda:UpdateFunctionConfiguration",
              + "lambda:UpdateFunctionUrlConfig",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:lambda:ca-central-1:992382783569:function:ai-answers-pr-review-*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:DescribeLogGroups",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DeleteLogGroup",
              + "logs:DeleteLogStream",
              + "logs:DeleteRetentionPolicy",
              + "logs:DescribeLogStreams",
              + "logs:PutRetentionPolicy",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:ca-central-1:992382783569:log-group:/aws/lambda/ai-answers-pr-review-*",
            ]
        }
    }

  # data.aws_iam_policy_document.pr_review_env will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "pr_review_env" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:UploadLayerPart",
                              + "ecr:SetRepositoryPolicy",
                              + "ecr:PutImage",
                              + "ecr:ListImages",
                              + "ecr:InitiateLayerUpload",
                              + "ecr:GetRepositoryPolicy",
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:DescribeRepositories",
                              + "ecr:DescribeImages",
                              + "ecr:CompleteLayerUpload",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchDeleteImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:ecr:ca-central-1:992382783569:repository/ai-answers-pr-review"
                        },
                      + {
                          + Action   = "ecr:GetAuthorizationToken"
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
    }

  # aws_iam_policy.ai_answers_pr_review will be created
  + resource "aws_iam_policy" "ai_answers_pr_review" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "ai-answers-pr-review"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CostCentre" = "ai-answers-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.pr-review-env-lambda will be created
  + resource "aws_iam_policy" "pr-review-env-lambda" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "pr-review-env-lambda"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:ca-central-1:992382783569:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CostCentre" = "ai-answers-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.pr-review-env-lambda will be created
  + resource "aws_iam_role" "pr-review-env-lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pr-review-env-lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CostCentre" = "ai-answers-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.pr-review-env-lambda will be created
  + resource "aws_iam_role_policy_attachment" "pr-review-env-lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "pr-review-env-lambda"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ai_answers_pr_review"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.pr-review-env-lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.ai-answers-ecs-role"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.pr-review-env-lambda"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
